def solution(s):
    split_list = []  # ცალკე ამოყრილი სია, სადაც ჩაიწერება შეყვანილი სტრინგის გაყოფილი ნაწილები

    if len(s) % 2 != 0:  # თუ სტრინგის სიგრძე არ არის ლუწი, დაემატება "_"
        s += "_"
    
    for i in range(0,len(s), 2):  # ციკლი სტრინგის ყველა მეორე ასაკეთი ინდექსზე
        second = s[i + 1]  # მეორე სიმბოლო ინდექსი i+1
        split_list.append(s[i] + second)  # სიგრძის გაყოფის ნაწილების დამატება სიაში
    
    return split_list  # დაბრუნების ნაბიჯი, ცალკე სია ყველა გაყოფილი სტრინგის ნაწილისთვის